In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = DataFrame({'key1': ['a','a','b','b','a'],
               'key2': ['one', 'two', 'one', 'two','one'],
               'data1': np.random.randn(5),
               'data2': np.random.randn(5)})

In [4]:
df

      data1     data2 key1 key2
0 -0.525922 -1.141364    a  one
1  0.132847  0.956452    a  two
2 -0.600669  0.018474    b  one
3  0.262228 -1.339504    b  two
4  0.783422 -1.252015    a  one

In [7]:
grouped = df['data1'].groupby(df['key1'])

In [8]:
grouped

In [9]:
grouped.mean()

key1
a    0.130116
b   -0.169221
Name: data1, dtype: float64

In [10]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [11]:
means

key1  key2
a     one     0.128750
      two     0.132847
b     one    -0.600669
      two     0.262228
Name: data1, dtype: float64

In [12]:
means.unstack()

key2       one       two
key1
a     0.128750  0.132847
b    -0.600669  0.262228

In [13]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [14]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [15]:
df['data1'].groupby([states, years]).mean()

California  2005    0.132847
            2006   -0.600669
Ohio        2005   -0.131847
            2006    0.783422
Name: data1, dtype: float64

In [17]:
df['data1'].groupby([years, states]).mean()

2005  California    0.132847
      Ohio         -0.131847
2006  California   -0.600669
      Ohio          0.783422
Name: data1, dtype: float64

In [18]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.130116 -0.478976
b    -0.169221 -0.660515

In [21]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.128750 -1.196689
     two   0.132847  0.956452
b    one  -0.600669  0.018474
     two   0.262228 -1.339504

In [22]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [23]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.525922 -1.141364    a  one
1  0.132847  0.956452    a  two
4  0.783422 -1.252015    a  one
b
      data1     data2 key1 key2
2 -0.600669  0.018474    b  one
3  0.262228 -1.339504    b  two

In [24]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.525922 -1.141364    a  one
4  0.783422 -1.252015    a  one
a two
      data1     data2 key1 key2
1  0.132847  0.956452    a  two
b one
      data1     data2 key1 key2
2 -0.600669  0.018474    b  one
b two
      data1     data2 key1 key2
3  0.262228 -1.339504    b  two

In [25]:
pieces = dict(list(df.groupby('key1')))

In [26]:
pieces['b']

      data1     data2 key1 key2
2 -0.600669  0.018474    b  one
3  0.262228 -1.339504    b  two

In [28]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [30]:
grouped1 = df.groupby(df.dtypes, axis=1)

In [36]:
df

      data1     data2 key1 key2
0 -0.525922 -1.141364    a  one
1  0.132847  0.956452    a  two
2 -0.600669  0.018474    b  one
3  0.262228 -1.339504    b  two
4  0.783422 -1.252015    a  one

In [31]:
dict(list(grouped1))

{dtype('float64'):       data1     data2
 0 -0.525922 -1.141364
 1  0.132847  0.956452
 2 -0.600669  0.018474
 3  0.262228 -1.339504
 4  0.783422 -1.252015, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [34]:
grouped0 = df.groupby(df.dtypes, axis=0)

In [35]:
dict(list(grouped0))

{}

In [37]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -1.196689
     two   0.956452
b    one   0.018474
     two  -1.339504

In [38]:
people = DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [41]:
people.loc[2:3, ['b', 'c']] = np.nan # Add a few NA values

In [42]:
people

               a         b         c         d         e
Joe     0.526553 -0.926024 -1.104638 -1.027086 -1.264288
Steve  -1.212985 -1.842331 -0.433744  0.390114  1.865452
Wes    -0.513472       NaN       NaN  0.353425 -0.944560
Jim    -0.760095 -1.025908  0.980990 -1.031608  1.073367
Travis  0.862731  0.898151  0.086648 -1.074664  1.291160

In [43]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [46]:
by_column = people.groupby(mapping, axis=1)

In [47]:
by_column.sum()

            blue       red
Joe    -2.131724 -1.663759
Steve  -0.043630 -1.189863
Wes     0.353425 -1.458033
Jim    -0.050618 -0.712636
Travis -0.988016  3.052042

In [48]:
map_series = Series(mapping)

In [49]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [50]:
people.groupby(map_series, axis=1).sum()

            blue       red
Joe    -2.131724 -1.663759
Steve  -0.043630 -1.189863
Wes     0.353425 -1.458033
Jim    -0.050618 -0.712636
Travis -0.988016  3.052042

In [53]:
people.groupby(len, axis=0).sum()

          a         b         c         d         e
3 -0.747015 -1.951932 -0.123648 -1.705269 -1.135482
5 -1.212985 -1.842331 -0.433744  0.390114  1.865452
6  0.862731  0.898151  0.086648 -1.074664  1.291160